Tekla Open API Reference for Tekla Structures 2025
SurfaceFilterExpressions Class
 The SurfaceFilterExpressions class contains all the surface object filter expressions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class SurfaceFilterExpressions
Public NotInheritable Class SurfaceFilterExpressions
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace